<template>
    <ArticleTemplate :header="headerContent" :footer="footerContent" :bgiPath="bgiPath">
        <div class="content" v-pre>
            <h1>转.  OPPO</h1>
            <h2>加入它</h2>

                <p>我的求职之路上着不同寻常的一点——<b>从未经历过面试失败。</b></p>

                <p>促成我面试从未失手的因素里，<b class="red">运气</b>占了很大比重。有时回想一下更是觉得自己实属幸运，和大部分普通高校毕业的同行相比，职业生涯的爬升路上<b>几乎没有遇到陡坡</b>。校招的那份工作，笔试题刚好考到了计算机二级的原题。从第一家公司去三星时，因为有JY的推波助澜，做了充足的准备，有惊无险拿下。而从三星离职时，是这么个情况：</p>

                <p>三年工作经验的我，<b>没有涉足过任何一项互联网行业的<b class="red">主流技术</b></b>。以我当时的那纸简历去投递互联网大厂、手机厂商，别说拿到Offer，拿到面试机会都有些困难。而彼时的OPPO正在南京组建研发中心，正值招兵买马的初创阶段，也为此<b>放低了招聘要求</b>，<b class="red">最低门槛</b>是<b>一本院校毕业，工作年限三年以上，有目标对口企业的工作经验</b>——我就卡在这个门槛上，一分不多，一分不少。</p>

                <p>面试官是前司的部长，且在老领导那里的印象分还不错，为了组建团队，快速扩张的目标，愿意接纳我。于是，<b>零安卓开发经验的我，拿到了一纸Android系统工程师的 Offer</b>，即将迈向一条全新的跑道。当时OPPO在南京的办公楼正在装修中，还没有稳定的办公场地，包括我在内的所有南京入职OPPO的新员工，都要去<b class="red">深圳</b>总部派驻两到三个月，一来有充足的工位，二来在总部工作可以帮助新员工快速融入。<b>2019年10月30日，怀揣憧憬的我从南京禄口机场踏上了南下的旅程，即将去往那座繁华的南方一线城市——深圳。</b></p>

            <h2>服务它</h2>

            <h3>启航</h3>
                <p>从<b>深圳宝安机场</b>乘坐地铁机场线，驶出没多远便穿出隧道，<b>一望无际的海</b>透过车窗映入眼帘，夺目的波光闪烁，投射在充满亚热带特色的植被上，从眼前匆匆流过。从后海下车，各具性格的摩天大楼鳞次栉比，带头的<b>春笋大厦</b>印证着这里是中国四大一线城市之一。迈过春笋，来到深圳人才公园，<b>深圳湾的绝妙海景</b>一览无余，对岸的香港隐约可见，温暖的海风令人无法想象这是即将立冬的时节——这是我对深圳的<b class="red">初印象</b>。而我对深圳的所有美好印象，都<b>定格在这第一天。</b></p>

                <p>在我去过的城市里，如果要从中挑出一个<b>最想去第二次</b>的，应当是<b>重庆</b>，而<b>最不想去第二次</b>的，<b>非深圳莫属</b>。走在深圳的随意一条街道上放眼望去，路边的小吃店是兰州拉面，是黄焖鸡米饭，是安徽板面，是淮南牛肉汤，是海南鸡饭，罕见一家<b>粤式餐厅</b>，我猜广州应当不是这个情况。如果你留意去听路人说的话，可以听到来自全国各地，五湖四海的方言，就是难以到一句<b>粤语</b>。你想多走一走，试图寻找一些细节，提取一些元素，来描绘这座城市的特质，但就是<b>找不到</b>，只觉得这儿的年轻人<b>走路很快，仿佛慢一步就会落人一拍</b>。即使你从未期待这座城市给你<b class="red">归属感</b>，轰鸣的钢筋工地和地铁站噪杂的人群，无时无刻不在提醒你——<b>嘿，这里不是你的家。</b></p>

                <p>春笋大厦正是<b>OPPO深圳总部的所在地</b>，这里是深圳的<b>地标性建筑</b>，华润集团的总部所在地，号称每个工位的月租金成本是<b class="red">6K</b>，我就在这样的顶级办公环境里入职了。我的主管也是前司的同事，零安卓经验的我自然也没有被分配到核心业务，以<b>适应，学习为主</b>，并且尽可能协助组内有经验的同事们做一做测试的工作，总体就两个字，<b class="red">打杂</b>。当时同在深圳派驻的同事们，许多都是已经成家有娃，独身来到深圳，这也给了我们一些难得的机会，可以在周末一起撸串喝酒，谈天说地，不为繁琐的日常而担忧。这段短暂而又珍贵的同事情谊，成为了异乡生活中<b>为数不多并值得回忆的美好片段</b>。</p>

                <p>在深圳的两个月多月里，每一天都觉得时间<b>如此漫长</b>，但是行将结束时，却又觉得时间过得<b>如此之快</b>。2020年元旦的跨年之夜，我是一个人在出租屋发呆渡过的。三天之后，深圳派驻之旅结束了，回到南京的那天晚上，我在一座商场的电梯间遇到了404南京市民<b class="red">李先生</b>，诧异了一下并回过神来，对着他的背影喊了一句：“<b>逼哥</b>，<b class="red">相信未来</b>！”，李先生回过头向我抿嘴示意，随后扬长而去。 这神奇的经历似乎在告诉我——<b>嘿，欢迎你回到南京。</b></p>

                <div class="imgBox">
                    <img src="./assets/shenzhen.jpg" alt="">
                    <div class="text">* 2019年12月摄于中国华润大厦春笋</div>
                </div>
            <h3>闯关</h3>
                <p>当我成为<b>第一批</b>入驻南京OPPO办公楼的员工，收拾好工位开始打量新环境时，时间已接近<b>2020年春节</b>。如你所知，从那时开始，<b class="red">新冠肺炎</b>开始席卷全国，春节放假回老家的我也因为疫情拖延了两周才回到南京。回去后大部门写字楼仍处于封控状态，只能用公司邮寄到家的工作笔记本电脑远程办公，直到3月初，办公室才陆续开放进入，而彼时的我已经入职超过四个月，<b>依然没有接触到核心业务</b>，每天的工作就是竞品调研，分析，测试这些边角活，<b>这让人心慌。</b></p>

                <p>也是在这个节骨眼上，主管突然找到我，通知我因为<b>部门内部业务调整，我要从系统优化组被调去游戏优化组</b>。这当然是通知，不是商量，没有选择的余地，而要调走的人里，也当然一定会包括我这个没有接触核心业务，没有任何不可替代性的小角色。起初得知这个消息，我是<b>抗拒的，挣扎的</b>，但很快就释然了——我是一个新人，在这个组是新人，去那个组也是新人。我什么都没有，自然也<b class="red">没什么可失去</b>，未知对我来说毫不可怕，那就<b>走呗。</b></p>

                <p>去到游戏优化组，组里的主管同事基本也都是前司的同事，不同的是他们是对口业务，平移到新公司，而我<b>不能说是啥也不会，只能说是<b class="red">一窍不通</b></b>。无论从业务上，还是从人际上，融入这个组对我来说都是<b>不小的挑战</b>。换组不久后，我被安插上了一个工作项——负责OPPO <a href="https://open.oppomobile.com/new/introduction?page_name=hyperboost" target="_blank"> Hyper Boost </a>性能开放能力相关业务。这项业务虽然算不上游戏优化的核心业务，但总归是个正经活，肯定比之前做边角料强出一大截，要知道在换组之前，我还没有在公司的代码仓里提过哪怕一笔代码，无论如何，这是件<b class="red">好事</b>。</p>

                <p>Android手机的大部分底层硬件能力，比如<b>调节CPU/GPU频率、调度线程优先级</b>等影响着性能、功耗指标的关键能力，三方应用是无法直接操纵的。而所谓性能开放能力，是指手机厂商们<b>通过系统层桥接，将部分操纵硬件的能力有节制的开放给三方应用</b>们使用，意图实现应用层和系统层的双向通话，让应用在必要的场景拥有自主调度硬件的能力，提升应用性能，优化用户体验，打造更好的<b>手机系统生态</b>。性能开放能力的主要受众应用是游戏，这个业务也就归属于游戏优化组。Hyper Boost以的<a href="https://www.zhihu.com/question/286904345" target="_blank"> SDK </a>形式开放，而开发这个SDK并不费劲，无非是一些业务逻辑的组装，<b class="red">承上启下</b>，为三方应用们提供一套能力API，在SDK和使用文档完成上线后，真正的工作才刚刚开始——我需要和负责开放平台的产品运营们一起，一家一家对接应用厂商，推广我们的能力，并充当技术客服，帮助应用厂商解决他们在接入能力过程中遇到的各种问题，最终<b>实现接入，达成合作。</b></p>

                <p>既然要搞三方合作，自然也给了我一些去到应用厂商宣讲交流的机会。为了推广我们的能力，我去过<b>北京的完美世界，去过杭州的网易游戏，并两度前往深圳，分别去到腾讯的TGPA项目组和字节跳动的性能中台项目组</b>，进行了深度的交流与合作。工作总要有产出，除了执笔OPPO开放平台Hyper Boost开发文档，支援OPPO开发者大会之外，还搞出了一件不大不小的事——<b>推动OPPO、高通、网易天谕手游的三方合作</b>，在Android手机厂商里<a href="https://new.qq.com/omn/20210424/20210424A09LZ400.html" target="_blank"> 首发 </a>了VRS可变分辨率渲染技术。</p>

                <p>故事讲到这里，看似前方<b>一片光明，未来可期</b>。可现实是，并非每个踏入<b class="red">迷宫</b>的闯关者，都能幸运得找到<b>出口。</b></p>

                <div class="imgBox">
                    <img src="./assets/yfq.jpg" alt="">
                    <div class="text">* 2020年3月摄于南京油坊桥地铁站</div>
                </div>
            <h3>死角</h3>
                <p>我在OPPO的部长，也是我在三星时的老领导，曾经在我入职三星的新人招待饭局上说过一段让我<b>牢记于心，终身难忘</b>的话：“<b>软件工程师也是<b class="red">手艺人</b>，写代码就是我们吃饭的手艺，无论到哪，手艺不能丢”。</b></p>

                <p>负责开放能力建设，相比于技术能力，更要求沟通能力与协作能力。对照着这段话，这项工作对于<b>精进我的手艺，也就是提升代码能力</b>，并没有什么<b>实质性帮助</b>。有时偶尔停下来回想一下，会惊觉自己已经好久没有坐下来好好写一写代码，思考一下应该用怎样的<b>数据结构</b>，怎么样的<b>设计模式</b>，去编写一段优雅的业务代码，让它具有良好的可维护性和可拓展性。事实上，据我对组内到部门再到对整个软件工程系统的观察，这家公司少有人在意“代码写的咋样”，换句话说，你的手艺咋样，并<b class="red">不重要</b>。</p>

                <p>游戏优化组的业务可以分成两大类——<b class="red">方案与交付</b>。方案是指为运行在OPPO手机上的游戏们定制一些性能、功耗优化的系统方案，做方案对开发人员的要求较高，我之前一直所做的开放能力业务，算是游离在<b>方案的边缘</b>。而交付，是指开发人员需要对一款机型从<b>立项，预研，开发，测试，量产</b>，直到交付到用户手上的过程中出现的所有游戏相关的<b>性能、功耗、发烫问题<b class="red">负责</b>。</b></p>

                <p>如果说做开放能力业务是<b>与“写代码”有些脱钩</b>，那做交付业务，基本上就是在<b>与“计算机与科学技术”这门学科<b class="red">失去关系</b></b>。这么说绝不是空口无凭，是从我的自身经验出发，结合对组内其他做业务业务同事的观察，在充分理解与总结之后<b>提炼</b>出来的。时间临近2020年末时，主管找到我，希望我能承担<b class="red"> Find X2 </b>系列机型的游戏优化交付工作，之前承担这个业务的是我的好朋友，他即将去负责一款全新的机型，而开放能力业务和其他一些零散的游戏方案业务并不能完全填充我的工作时间，我也乐意多学一点，拓展自己的知识边界，于是欣然接下了这项任务。</p>

                <p>我不想用<b>流水账</b>的形式来呈现做游戏交付业务的过程，只想列举一些<b class="red">事实</b>，用于解释什么叫做<b>“与计算机与科学技术这门学科失去关系”</b>：</p>

                <div>
                    <li>在一款机型上市前的开发阶段，测试部门会测试大部分热门游戏，并创建<b>一堆卡顿、发烫之类的Bug</b>，而负责游戏交付业务的工程师需要逐个<b class="red">关闭</b>这些Bug，不解决就无法通过一些所谓的“项目节点”，影响项目进度。而这里存在着一个很明显的<b class="red">悖论</b>：<b>我们要对游戏性能负责，但手机系统里存在许多影响性能的关键模块，其代码掌握在其他项目组手里，我们根本插足不了</b>。于是为了关掉一个Bug，需要和很多其他部门甚至其他系统的项目组<b>Battle</b>，要和测试人员<b>扯皮，争论"<b>这个Bug究竟是不是个Bug"</b></b>。
                        <br>总之，解决的<b>是<b class="red"> Bug </b>，不是问题。</b></li>
                    <li>机型上市之后，用于考核游戏交付业务绩效的核心指标，叫做<a href="https://baike.baidu.com/item/%E5%87%80%E6%8E%A8%E8%8D%90%E5%80%BC/3783368?fromtitle=NPS&fromid=17751327&fr=aladdin" target="_blank"> NPS </a>（用户净推荐值）。用户填写NPS问卷时，如果给了差评，那么负责相应机型交付业务的工程师就要做客服，给那个差评的客户<b>打电话，安抚情绪，加微信，随时准备解答客户的问题，<b class="red">央求</b>下次问卷能不能不打差评</b>，仿佛这家大公司在工程师和用户之间的<b>所有流程，所有角色都不存在</b>一样。我曾经亲耳听到一个工程师同事打电话给客户，开头就说：”你好，我是OPPO的客服...“，实在是<b>好笑又令人心疼</b>。
                        <br>总之，解决的<b>是<b class="red">用户</b>，不是问题。</b></li>
                    <li>大老板有时会在一些<b>社交平台</b>看到用户吐槽游戏体验不好，然后<b class="red">层层施压</b>找到我们，我们就要千方百计联系到那个用户，像处理NPS差评一样服务那个用户，<b>当客服，做陪聊，生怕客户再去社交平台吐槽</b>，然后每天给大老板汇报一下进展，告诉他我们安抚住了用户，用户情绪稳定，方案已在路上之类的。我就曾经被拉进一个标题为<b>【XX总关注】【XX机型】【XX问题】的工作群</b>，里头有<b>浩浩荡荡接近50个人</b>，人员构成大致是<b>10个主管，5个部长，10个产品经理，10个测试经理，10个公关经理，</b><b class="red">指挥</b>我和其他两名工程师干活。<b>一个诺大的寺庙里，挑水的和尚就三个</b>。
                        <br>总之，解决的<b>是<b class="red">老板</b>，不是问题。</b></li>
                </div>

                <p>OPPO内部似乎有一种<b>崇尚所谓<b class="red">“业务能力”</b></b>的氛围，如果你对项目流程很<b>熟练</b>，对和各个角色<b>扯皮得心应手</b>，能用一个又一个连环夺命电话<b>指挥其他人帮你做事</b>，能在一些有大老板在场的会议<b>侃侃而谈</b>，仿佛你就是一名<b class="red">优秀</b>的的软件工程师了。我对此实在<b>嗤之以鼻</b>，这让我想起了大洋彼岸的美国著名篮球评论员<b class="red">A史密斯</b>先生对于NBA湖人队后卫<b>威斯布鲁克</b>关于<b>“生活大于篮球”</b>观点的一段评论，大概是这样说的：“<b>威斯布鲁克先生，你是一个绝对的好人，一位积极的社区贡献者，一位热衷于公益事业的慈善家，一位伟大的丈夫和爸爸，我很尊重这些，可是<b class="red">这和你的球有他妈什么关系？</b>”</b></p>
            <h2>离开它</h2>
                <p><b class="red">消极</b>的情绪在<b>迅速蔓延</b>，一头蹿进<b class="red">死角</b>的我已经无力无心再寻找出口，只想立刻<b>翻墙逃离</b>。时间来到2021年春节假期，我做出了两个重要决定：1. <b>我必须要离职</b>； 2. <b>我必须要去微软</b>。第一个决定，上文已有解释，第二个决定，会在下一篇也是大厂之路的完结篇详聊。</p>

                <p>虽然从<b>任何角度我都无法认同这家公司的工作方式</b>，也从未觉得自己真正融入过这家公司，但即将离开时，<b>对于这里的人们</b>，心中唯有<b class="red">感恩</b>。感恩我的部长，愿意在我毫无Android经验的时候<b>接纳我，培养我，给我一个转向主流技术的机会</b>。感恩我的主管们，用充分的耐心给了我充足的学习时间，愿意分配给我<b>分量不轻的业务</b>。感恩我的同事们，从未嫌弃一个新人，每一次的悉心指导和教学都让我<b>受益匪浅。</b></p>

                <p>离职面谈上，我和部长、主管、HR们<b>开诚布公，一五一十</b>得把我对这家公司，这份工作的真实想法<b>全盘托出</b>，我知道<b>这儿的一切并不是你们每个个人能决定的</b>，但这不妨碍我把你们当作朋友，并不妨碍我对这段旅程充满感恩，并不妨碍我<b>满怀期待</b>走向<b class="red">遥远的前方</b>。</p>
            <div class="ending">
                <div class="imgBox">
                    <img src="./assets/ddb.jpg" alt="">
                    <div class="text">* 2021年4月摄于新疆赛里木湖</div>
                </div>

                <p>于是，转身向山里走去。</p>
                <p>于是，转身向大海走去。</p>
            </div>
        </div>
    </ArticleTemplate>
</template>


<script>
import ArticleTemplate from '../ArticleTemplate.vue'

export default {
    components: {
        ArticleTemplate
    },
    setup() {
        let data = {
            headerContent: {
                title: "双非一本程序员的大厂之路（三）",
                mark: "迷宫有出口，更有死角。",
                item: "Professional Career. 04",
            },
            footerContent: {
                left: "2022/07/20",
                right: "#感恩这段旅程，前路依然遥远",
            },
            bgiPath: require('./assets/op2.jpg')
        }

        return {
            ...(data)
        }
    }
}
</script>

<style lang="less" scoped>
.content {
    font-size: 18px;
    line-height: 1.625;
    font-weight: 500;

    * {
        margin-bottom: 12px;
    }

    .imgBox {
        width: 100%;
        padding: 5px 10px;

        img {
            width: 100%;
        }

        .text {
            width: 100%;
            font-size: 14px;
            text-align: center;
        }
    }

    a {
        border-bottom: 1px solid rgba(183, 69, 47, .7);
        color: #B7452f;
        font-weight: 700;
        transition: all .1s;
    }

    a:hover {
        border-bottom: 2px solid rgba(183, 69, 47, 1);
    }

    li {
        margin-top: 5px;
        margin-bottom: 5px;
    }

    h1,h2,h3 {
        color: #A0A0A0
    }

    h2 {
        margin-top: 20px;
    }

    .ending {
        border-top: 1px solid;
        border-image: linear-gradient(to right, rgba(100,100,100,.5), rgba(100,100,100,.1)) 1;
        margin-top: 30px;
        padding-top: 20px;
        font-weight: 700;
    }

    li {
        padding-left: 20px;
    }

    li:hover a {
        color: #B7452f;
    }

    .tonext {
        margin-top: 20px;
        cursor: pointer;
    }
}
</style>